In [1]:
from DATA225utils import make_connection, dataframe_query
from pandas import DataFrame

In [13]:
conn = make_connection(config_file = 'school.ini')
cursor = conn.cursor()

#### A Python function that displays in a dataframe the results from a call to a stored procedure.

In [3]:
def display_results(cursor):
    """
    If there are results in the cursor from a call to a
    stored procedure, display the results in a dataframe. 
    """
    columns = result.description
    
    if columns == None:
        return 
    
    else:
        column_names = [column_info[0] 
                        for column_info in columns]

        rows = cursor.fetchall()
    
        if len(rows) > 0:
            df = DataFrame(rows)
            df.columns = column_names
            
            display(df)
        
        else:
            return

# Call stored procedure `all_students()`

#### There are two ways to call a stored procedure from Python: use SQL's `CALL` command, or use the cursor's `callproc()` method. Each requires a different way to retrieve the tabular results.

### Use SQL's `CALL` command

In [4]:
sql = 'CALL all_students'
print(sql)
print()

generator = cursor.execute(sql, multi=True)

for result in generator:
    display_results(result)

CALL all_students

      id   last   first contact_id
0  S1001    Doe    John        C03
1  S1005  Novak     Tim        C04
2  S1009  Klein  Leslie        C05
3  S1014   Jane    Mary        C01
4  S1021  Smith     Kim        C02

### Use the cursor method `callproc()`

In [5]:
print("cursor.callproc('all_students')")
print()

cursor.callproc('all_students')

for result in cursor.stored_results():
    display_results(result)

cursor.callproc('all_students')

      id   last   first contact_id
0  S1001    Doe    John        C03
1  S1005  Novak     Tim        C04
2  S1009  Klein  Leslie        C05
3  S1014   Jane    Mary        C01
4  S1021  Smith     Kim        C02

# Call stored procedure `class_codes_of()` for John Doe

### Use SQL's `CALL` command

In [7]:
sql = f"CALL class_codes_of('John', 'Doe')"
print()
print(sql)
print()

generator = cursor.execute(sql, multi=True)

for result in generator:
    display_results(result)

CALL class_codes_of('John', 'Doe')

       code
0  DATA 220
1  DATA 225
2  DATA 240

### Use the cursor method `callproc()`

In [15]:
print(f"cursor.callproc('class_codes_of', {('John', 'Doe')}")
print()

cursor.callproc('class_codes_of', ('John', 'Doe'))

for result in cursor.stored_results():
    display_results(result)

cursor.callproc('class_codes_of', ('John', 'Doe')

       code
0  DATA 220
1  DATA 225
2  DATA 240

# Call stored procedure `class_codes_of()` for each student

### First get a list of students' names.

In [6]:
cursor.execute('SELECT first, last FROM student')

students = cursor.fetchall()
students

[('John', 'Doe'),
 ('Tim', 'Novak'),
 ('Leslie', 'Klein'),
 ('Mary', 'Jane'),
 ('Kim', 'Smith')]

### Use SQL's `CALL` command

In [16]:
for first, last in students:
    sql = f"CALL class_codes_of('{first}', '{last}')"
    print()
    print(sql)
    print()
    
    generator = cursor.execute(sql, multi=True)
    
    for result in generator:
        display_results(result)

CALL class_codes_of('John', 'Doe')

       code
0  DATA 220
1  DATA 225
2  DATA 240

CALL class_codes_of('Tim', 'Novak')

       code
0  DATA 220
1  DATA 225
2  DATA 245

CALL class_codes_of('Leslie', 'Klein')


CALL class_codes_of('Mary', 'Jane')

       code
0  DATA 200
1  DATA 245

CALL class_codes_of('Kim', 'Smith')

       code
0  DATA 200
1  DATA 225
2  DATA 240

### Use the cursor method `callproc()`

In [17]:
for student in students:    
    print()
    print(f"cursor.callproc('class_codes_of', {student})")
    print()
    
    cursor.callproc('class_codes_of', student)
    
    for result in cursor.stored_results():
        display_results(result)

cursor.callproc('class_codes_of', ('John', 'Doe'))

       code
0  DATA 220
1  DATA 225
2  DATA 240

cursor.callproc('class_codes_of', ('Tim', 'Novak'))

       code
0  DATA 220
1  DATA 225
2  DATA 245

cursor.callproc('class_codes_of', ('Leslie', 'Klein'))


cursor.callproc('class_codes_of', ('Mary', 'Jane'))

       code
0  DATA 200
1  DATA 245

cursor.callproc('class_codes_of', ('Kim', 'Smith'))

       code
0  DATA 200
1  DATA 225
2  DATA 240

# Call stored procedure `classmates_of()`

### Use SQL's `CALL` command

In [10]:
for first, last in students:
    sql = f"CALL classmates_of('{first}', '{last}')"
    print()
    print(sql)
    print()
    
    generator = cursor.execute(sql, multi=True)
    
    for result in generator:
        display_results(result)

CALL classmates_of('John', 'Doe')

  first   last      code              subject
0   Tim  Novak  DATA 220  Mathematical Models
1   Tim  Novak  DATA 225     Database Systems
2   Kim  Smith  DATA 225     Database Systems
3   Kim  Smith  DATA 240          Data Mining

CALL classmates_of('Tim', 'Novak')

  first   last      code              subject
0  John    Doe  DATA 220  Mathematical Models
1  John    Doe  DATA 225     Database Systems
2   Kim  Smith  DATA 225     Database Systems
3  Mary   Jane  DATA 245     Machine Learning

CALL classmates_of('Leslie', 'Klein')


CALL classmates_of('Mary', 'Jane')

  first   last      code             subject
0   Kim  Smith  DATA 200  Python Programming
1   Tim  Novak  DATA 245    Machine Learning

CALL classmates_of('Kim', 'Smith')

  first   last      code             subject
0  Mary   Jane  DATA 200  Python Programming
1  John    Doe  DATA 225    Database Systems
2   Tim  Novak  DATA 225    Database Systems
3  John    Doe  DATA 240         Data Mining

### Use the cursor method `callproc()`

In [11]:
for student in students:
    first, last = student
    
    print()
    print(f"cursor.callproc('classmates_of', {student})")
    print()
    
    cursor.callproc('classmates_of', student)
    
    for result in cursor.stored_results():
        display_results(result)

cursor.callproc('classmates_of', ('John', 'Doe'))

  first   last      code              subject
0   Tim  Novak  DATA 220  Mathematical Models
1   Tim  Novak  DATA 225     Database Systems
2   Kim  Smith  DATA 225     Database Systems
3   Kim  Smith  DATA 240          Data Mining

cursor.callproc('classmates_of', ('Tim', 'Novak'))

  first   last      code              subject
0  John    Doe  DATA 220  Mathematical Models
1  John    Doe  DATA 225     Database Systems
2   Kim  Smith  DATA 225     Database Systems
3  Mary   Jane  DATA 245     Machine Learning

cursor.callproc('classmates_of', ('Leslie', 'Klein'))


cursor.callproc('classmates_of', ('Mary', 'Jane'))

  first   last      code             subject
0   Kim  Smith  DATA 200  Python Programming
1   Tim  Novak  DATA 245    Machine Learning

cursor.callproc('classmates_of', ('Kim', 'Smith'))

  first   last      code             subject
0  Mary   Jane  DATA 200  Python Programming
1  John    Doe  DATA 225    Database Systems
2   Tim  Novak  DATA 225    Database Systems
3  John    Doe  DATA 240         Data Mining

In [12]:
cursor.close()
conn.close()